package ru.dvfu.mrcpk.java.proj01.MyArrays01;

public class MyArraysPractice {

    public static void main(String[] args) {
        /*double[] myList = {1.2, 2.3, 3.4, 4.5, 5.6};

        // Вывести на экран все элементы массива
        for (int i = 0; i < myList.length; i++) {
            System.out.print(myList[i] + " ");
        }
        System.out.println();

        // Вывод на экран первого и третьего элементов массива
        System.out.println("Первый элемент массива: " + myList[0]);
        System.out.println("Третий элемент массива: " + myList[2]);
        double sum1 = myList[0] + myList[4];
        System.out.println("Сумма первого и последнего элементов: " + sum1);

        // Сумма всех элементов массива
        double sum2 = 0, z = 1;
        for (int i = 0; i < myList.length; i++) {
            sum2 += myList[i];
            z *= myList[i];
        }
        System.out.println("Сумма всех элементов: " + sum2);
        System.out.print("Произведение всех элементов: ");
        System.out.format("%.2f\n", z);     // вывод двух знаков после запятой с новой строки

        // Нахождение наибольшего значения среди элементов
        double max = myList[0];
        for (int i = 0; i < myList.length; i++) {
            if (myList[i] > max) max = myList[i];
        }
        System.out.println("Наибольший элемент: " + max);

        // Нахождение наименьшего значения среди элементов
        double min = myList[0];
        for (int i = 0; i < myList.length; i++) {
            if (myList[i] < min) min = myList[i];
        }
        System.out.println("Наименьший элемент: " + min);

        // Вывести массив на экран
        for (double element: myList) {
            System.out.println(element);
        }
        // Вывести массив на экран в одну строку
        for (double element: myList) {
            System.out.print(element + " ");
        }
        System.out.println();   // добавим пустую строку
        System.out.println("Количество элементов в массиве: " + myList.length);*/

        /*int twoD[][] = new int [5][10];
        int i, j, k = 1;

        for (i = 0; i < 5; i++)
            for (j = 0; j < 10; j++){
                twoD[i][j] = k;
                k++;
            }

        for (i = 0; i < 5; i++){
            for (j = 0; j < 10; j++)
                System.out.print(twoD[i][j] + " ");
            System.out.println();
        }*/




    }
}
